[
    {
        "content": "\n\t\t\t\t\t\t\t<p>Here we are, my very first blog post. The main objective of\n\t\t\t\t\t\t\tthis post is to give a little taste of who I am as a person\n\t\t\t\t\t\t\tand also motivate the existence of this site.</p>\n\n\t\t\t\t\t\t\t<p>So who am I? Well, at risk of plagiarising my own Linked-In profile, I am a graduate student at the University of Virginia\n\t\t\t\t\t\t\tcurrently pursuing my Masters in Data Science. I chose to pursue this degree as I saw Data Science as the most cutting-edge manifestation of the subjects I studied as an undergrad\n\t\t\t\t\t\t\t(I double majored in Computer Science and Mathematics with a concentration in Probability and Statistics, also at the University of Virginia). I will complete\n\t\t\t\t\t\t\tthis degree in May 2018, so I am also going through the trials\n\t\t\t\t\t\t\tand tribulations of a first-time job seeker. That being said, I do\n\t\t\t\t\t\t\tnot want to get into too much more detail about myself here,\n\t\t\t\t\t\t\tbecause that is what this site is about! Exploring it should give\n\t\t\t\t\t\t\tyou a relatively complete picture of who I am and what I am\n\t\t\t\t\t\t\tall about.</p>\n\n\t\t\t\t\t\t\t<p>So why exactly am I making a site for myself? I've listed\n\t\t\t\t\t\t\ta few compelling reasons on the homepage of this site,\n\t\t\t\t\t\t\tbut really the motivation for this site came from enough\n\t\t\t\t\t\t\tpeople telling me that it would be a good idea to have\n\t\t\t\t\t\t\ta personal site. I put off making one for various reasons,\n\t\t\t\t\t\t\tbut once I discovered that I already used (Github), had\n\t\t\t\t\t\t\ta mechanism for hosting static websites for free (Github Pages),\n\t\t\t\t\t\t\tI was officially out of excuses. I can think of a few additional reasons beyond what has already been listed. I think the exercise of publishing content could very well change the way\n\t\t\t\t\t\t\tI interact with the world. Whenever I am undergoing some\n\t\t\t\t\t\t\tinteresting or challenging problem in my life, I can view it through the lens of something that can be written up and\n\t\t\t\t\t\t\tposted to the world. I imagine that this will\n\t\t\t\t\t\t\thelp me engage with the world around me. Publishing is also\n\t\t\t\t\t\t\ta good mechanism to help hold myself accountable. My next\n\t\t\t\t\t\t\tblog post is going to involve my 2017-2018 New Years resolutions and the hope is that putting them out in a more\n\t\t\t\t\t\t\tpermanent way online will help me to actually remember and\n\t\t\t\t\t\t\tfollow through on them.</p>\n\n\t\t\t\t\t\t\t<p>So what exactly do I want this site to be? At the end of the day,\n\t\t\t\t\t\t\tI just it to be the most complete digital picture of myself out\n\t\t\t\t\t\t\tthere, and one that I have complete and total control over.\n\t\t\t\t\t\t\tBeyond that, I do not know what this site could become. Most\n\t\t\t\t\t\t\tnotably, I do not want to set any sort of goal or theme for this\n\t\t\t\t\t\t\tblog. It will certainly contain updates on my Capstone research\n\t\t\t\t\t\t\tand experience as a first-time job hunter, but I do not want to\n\t\t\t\t\t\t\tlimit myself to those things. This is really an outlet to share\n\t\t\t\t\t\t\tanything in my life that I think others might find useful.</p>\n\n\t\t\t\t\t\t\t<p>Will that in mind, I hope that you will explore the rest of my site and I can't wait to see how this project evolves!</p>\n\t\t\t\t\t\t\t",
        "date": "12/23/2017",
        "location": "blog/2017/introduction.html",
        "name": "Introduction Blog"
    },
    {
        "content": "\n\t\t\t\t\t\t<p>I'm going to be honest here, I am not the biggest fan of New\n\t\t\t\t\t\tYears Resolutions. Don't get me wrong, I think the idea of\n\t\t\t\t\t\tidentifying areas for self-improvement and working\n\t\t\t\t\t\ttowards those goals is great, I just think waiting for\n\t\t\t\t\t\ta calendar to tell you \"it's time to improve yourself\"\n\t\t\t\t\t\tis a bit silly. However, I do think the New Years at least\n\t\t\t\t\t\tprovides a time to sit back and reflect, especially since\n\t\t\t\t\t\tit is around this time that people, myself included, have\n\t\t\t\t\t\tsome time off and therefore can spend time reflecting.\n\t\t\t\t\t\tI've decided this year to publish my New Years Resolutions,\n\t\t\t\t\t\tmostly so I have a tangible and public set of goals, so\n\t\t\t\t\t\tanyone that reads this and knows me can hold me accountable to these resolutions. Also, I frankly do not remember what\n\t\t\t\t\t\tmy resolutions last year were, so having them easily accessible\n\t\t\t\t\t\tshould increase my chances of actually doing them.</p>\n\n\t\t\t\t\t\t<p>Without further ado, let's jump into my New Years Resolutions for 2018.<p>\n\t\t\t\t\t\t<ol>\n\t\t\t\t\t\t<li> <strong>Consume less, create more.</strong> I do not\n\t\t\t\t\t\tconsider myself a procrastinator. In fact, I am pretty good\n\t\t\t\t\t\tat getting things done well before they need to be done.\n\t\t\t\t\t\tHowever, I am quite adept at wasting time. Too much of\n\t\t\t\t\t\tmy day is spent consuming content that adds no real\n\t\t\t\t\t\tvalue to my life. Youtube and Netflix are the worst offenders here, with\n\t\t\t\t\t\tFacebook and Snapchat being close runner-ups. A simple\n\t\t\t\t\t\tway to achieve this goal would be to remove myself from\n\t\t\t\t\t\tthose platforms, but I do not see that as realistic. There are\n\t\t\t\t\t\tvery good things those platforms have to offer, I just need\n\t\t\t\t\t\tto be better at practicing moderation. More tangibly, \n\t\t\t\t\t\tI need to not use them just as a means to kill time. What\n\t\t\t\t\t\tdo I plan on doing with all the time I'll be getting back?\n\t\t\t\t\t\tWell, create more, whatever that may look like. This\n\t\t\t\t\t\twebsite is a great start, so maintaining and growing it\n\t\t\t\t\t\tout will be a good way to work towards this goal. Getting back\n\t\t\t\t\t\tinto writing music, and maybe this time actually record some\n\t\t\t\t\t\tof it, will also be valuable in achieving this goal.\n\t\t\t\t\t\tContinuing to work on the <i>projmanr</i> R package and\n\t\t\t\t\t\t<i>Super Smash Bros. SE</i> game mod will also be productive as well.</li>\n\n\t\t\t\t\t\t<li><strong>Invest more in people.</strong> I admit it,\n\t\t\t\t\t\tI can be a bit of a workaholic. For easily the past decade\n\t\t\t\t\t\tof my life, school has been the most important aspect\n\t\t\t\t\t\tof my life, especially my last four years in college.\n\t\t\t\t\t\tThis emphasis on my education has really led me\n\t\t\t\t\t\tto neglect the people in my life, especially my group\n\t\t\t\t\t\tof friends.\n\t\t\t\t\t\tBut I am really starting to see that while learning is\n\t\t\t\t\t\tincredibly important, school itself really isn't. Well,\n\t\t\t\t\t\tlet me rephrase that. Certain very time-consuming\n\t\t\t\t\t\taspects of school, like grades, really aren''t that important.\n\t\t\t\t\t\tMy time would be much better spent ensuring that I have\n\t\t\t\t\t\tlearned the material, and not worrying that much about\n\t\t\t\t\t\tgrades at all. All the time I can save here can be reinvested\n\t\t\t\t\t\tin the people around me. And even if I am not \n\t\t\t\t\t\tsuccessful in truly convincing myself to put less time into\n\t\t\t\t\t\tmy schoolwork, there is still a whole lot of wasted time\n\t\t\t\t\t\tin my life (see 1), that I can get a hold of and redirect to\n\t\t\t\t\t\tthe people that I care about (and even finding new people\n\t\t\t\t\t\tto care about!).\n\t\t\t\t\t\t</li>\n\t\t\t\t\t\t<li><strong>Change the way I eat food.</strong> No, I am not\n\t\t\t\t\t\tgoing on a diet. This resolution has nothing to do with what\n\t\t\t\t\t\tor how much I eat, but rather <i>why</i> I eat. I am very happy\n\t\t\t\t\t\twith my weight and overall think I have a pretty strong diet. \n\t\t\t\t\t\tBut I do, far too often, find myself eating for reasons other than\n\t\t\t\t\t\t\"I'm hungry.\" The most sinister of these is eating out of habit.\n\t\t\t\t\t\tIf I normally get a milkshake from Five Guys on Mondays, then\n\t\t\t\t\t\tI often find myself getting a milkshake from Five Guys on Mondays, even if I am not hungry in the least! These patterns\n\t\t\t\t\t\tare going to be hard to break, but ultimately it is very important\n\t\t\t\t\t\tthat I do it now, when my metabolism is still forgiving. There\n\t\t\t\t\t\tare other reasons for eating, like stress, boredom, or socializing\n\t\t\t\t\t\tthat I hope to break, but if I can eradicate habitual eating, I will\n\t\t\t\t\t\tconsider this resolution a success. </li>\n\t\t\t\t\t\t</ol>\n\n\t\t\t\t\t\t<p>So there they are. I intentionally left my resolutions a little bit vague, without too many specific ways to achieve them. This is because my life at the moment can be so sporadic that I\n\t\t\t\t\t\tthink getting to nitty-gritty with my resolutions will sharply\n\t\t\t\t\t\tdecrease my chance of attaining them. I intend to post\n\t\t\t\t\t\tupdates as the year progresses. Happy New Year!\n\t\t\t\t\t\t",
        "date": "12/26/2017",
        "location": "blog/2017/resolutions.html",
        "name": "2017 New Years Resolutions"
    }
]