[
    {
        "quote": "When it comes to human beings, the truth is rarely simple and only sometimes true.",
        "title": "Miscellaneous"
    },
    {
        "quote": "... try seeing yourself through the eyes of someone who admires you. <i>Page 49</i>",
        "title": "You are a Badass"
    },
    {
        "quote": "To the dumb question “Why me?” the cosmos barely bothers to return the reply: Why not?",
        "title": "Mortality"
    },
    {
        "quote": "It all seems so very arbitrary. I applied for a job at this company because they were hiring. I took a desk at the back because it was empty. But…[chuckles] no matter how you get there or where you end up, human beings have this miraculous gift to make that place home. <i>Creed</i>",
        "title": "The Office"
    },
    {
        "quote": "Listen, Morty, I hate to break it to you but what people call \"love\" is just a chemical reaction that compels animals to breed. It hits hard, Morty, then it slowly fades, leaving you stranded in a failing marriage. I did it. Your parents are gonna do it. Break the cycle, Morty. Rise above. Focus on science. <i>Rick</i>",
        "title": "Rick and Morty"
    },
    {
        "quote": "Are you falling in love with her? <strong>Does that make me a freak?</strong> No, no. I think it's - I think anybody that falls in love is a freak. It's a crazy thing to do in the first place. It's kind of a form of socially acceptable insanity. <i>Amy. <strong>Theodore</strong></i>",
        "title": "Her"
    },
    {
        "quote": "... sometimes you realize the journey you've been taking has reached its final stop. So, the question becomes: Where do you go next? <i>Ted</i>",
        "title": "How I Met Your Mother"
    },
    {
        "quote": "Nobody exists on purpose. Nobody belongs anywhere. We're all going to die. Come watch TV. <i>Morty</i>",
        "title": "Rick and Morty"
    },
    {
        "quote": "The most important thing I learned on Tralfamadore was that when a person dies he only appears to die. He is still very much alive in the past, so it is very silly for people to cry at his funeral. All moments, past, present, and future, always have existed, always will exist. The Tralfamadorians can look at all the different moments just the way we can look at a stretch of the Rocky Mountains, for instance. They can see how permanent all the moments are, and they can look at any moment that interests them. It is just an illusion we have here on Earth that one moment follows another one, like beads on a string, and that once a moment is gone it is gone forever. “When a Tralfamadorian sees a corpse, all he thinks is that the dead person is in bad condition in that particular moment, but that the same person is just fine in plenty of other moments. Now, when I myself hear that somebody is dead, I simply shrug and say what the Tralfamadorians say about dead people, which is ‘So it goes.’ <i>Page 33</i>",
        "title": "Slaughterhouse-Five"
    },
    {
        "quote": "Try not to be scared of unhappiness. One day, sadness will rear its ugly head, and on that day, you don't want to be left scared <i>and</i> unhappy.",
        "title": "Miscellaneous"
    },
    {
        "quote": "They just want to be in a place where they have the world behind them, and before them nothing but emptiness. <i>Page 52</i>",
        "title": "The Rings of Saturn"
    },
    {
        "quote": "Sometimes I think I've felt everything I'm ever gonna feel and from here on out I'm not going to feel anything new - just lesser versions of what I've already felt. <i>Theodore</i>",
        "title": "Her"
    },
    {
        "quote": "“Until you have done something for humanity,” wrote the great American educator Horace Mann, “you should be ashamed to die.”",
        "title": "Mortality"
    },
    {
        "quote": "Once, he’d been satisfied by the music alone. Now he had learned about friendship, and it was no longer enough to play without an audience. <i>Page 90</i>",
        "title": "The Lord of Opium"
    },
    {
        "quote": "Billy had a framed prayer on his office wall which expressed his method for keeping going, even though he was unenthusiastic about living. A lot of patients who saw the prayer on Billy’s wall told him that it helped them to keep going, too. It went like this: GOD GRANT ME THE SERENITY TO ACCEPT THE THINGS I CANNOT CHANGE, COURAGE TO CHANGE THE THINGS I CAN, AND WISDOM ALWAYS TO TELL THE DIFFERENCE. Among the things Billy Pilgrim could not change were the past, the present, and the future. <i>Page 76</i>",
        "title": "Slaughterhouse-Five"
    },
    {
        "quote": "Science is magic that works.",
        "title": "Cat's Cradle"
    },
    {
        "quote": "Lame, vague goals are the best way to live a lame, vague life. <i>Page 221</i>",
        "title": "You are a Badass"
    }
]